In [1]:
import pandas as pd

## Address

In [2]:
address = pd.read_csv('data/address.csv')
address.head()

         ward    district         city
0  An Phú Tây  Bình Chánh  Hồ Chí Minh
1  Bình Chánh  Bình Chánh  Hồ Chí Minh
2   Bình Hưng  Bình Chánh  Hồ Chí Minh
3    Bình Lợi  Bình Chánh  Hồ Chí Minh
4    Đa Phước  Bình Chánh  Hồ Chí Minh

In [3]:
address.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 322 entries, 0 to 321
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ward      322 non-null    object
 1   district  322 non-null    object
 2   city      322 non-null    object
dtypes: object(3)
memory usage: 7.7+ KB

## Employee

In [4]:
employee = pd.read_csv('data/employee.csv', dtype={'national_id': str, 'insurance_id': str})
employee.head()

               name date_of_birth nationality national_id insurance_id
0  Trương Vĩnh Linh    1985-03-28    Việt Nam   984073163   0660283306
1   Nguyễn Hữu Tình    1992-10-12    Việt Nam   764550275   0393233223
2     Lê Trọng Ngọc    1992-03-03    Việt Nam   802805783   0365014560
3   Nguyễn Chí Kiên    1991-12-10    Việt Nam   667858887   0519166933
4   Đặng Quang Vinh    1982-07-12    Việt Nam   585844696   0153681259

In [5]:
# employee['date_of_birth'] = pd.to_datetime(employee['date_of_birth'])

In [6]:
employee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 171 entries, 0 to 170
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           171 non-null    object
 1   date_of_birth  171 non-null    object
 2   nationality    171 non-null    object
 3   national_id    171 non-null    object
 4   insurance_id   171 non-null    object
dtypes: object(5)
memory usage: 6.8+ KB

## Student

In [7]:
student = pd.read_csv('data/student.csv', dtype={'mssv': str, 'national_id': str})
student.head()

,mssv,student_name,class_name,edu_mail,national_id,address_id
0,19333301,Nguyễn Thanh An,KHDL15A,an.19333301@student.iuh.edu.vn,712660055,21
1,19333311,Thái Nữ Bình An,HTTT15A,an.19333311@student.iuh.edu.vn,971121231,203
2,19333321,Trần Thị Mỹ An,HTTT15B,an.19333321@student.iuh.edu.vn,570468448,171
3,19333331,Bùi Thị Nguyên Anh,HTTT15A,anh.19333331@student.iuh.edu.vn,559000364,44
4,19333341,Châu Ngọc Thạch Anh,KTPM15B,anh.19333341@student.iuh.edu.vn,982742968,132

In [8]:
student.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2161 entries, 0 to 2160
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mssv          2161 non-null   object
 1   student_name  2161 non-null   object
 2   class_name    2161 non-null   object
 3   edu_mail      2161 non-null   object
 4   national_id   2161 non-null   object
 5   address_id    2161 non-null   int64
dtypes: int64(1), object(5)
memory usage: 101.4+ KB

## Lecturer

In [9]:
lecturer = pd.read_csv('data/lecturer.csv')
lecturer.head()

,Lecturer ID,Employee ID,Academic Title,Academic Title Date,Degree,Degree Issue Date,Degree Issue Place,Major,Department,Number Of Exp
0,1,1,Không,2015-03-31,Tiến sĩ,2015-03-31,Poland,Công nghệ thông tin,Khoa Công nghệ thông tin,5
1,2,2,Không,2015-02-05,Thạc sĩ,2015-02-05,Russia,Khoa học máy tính,Khoa Công nghệ thông tin,14
2,3,3,Không,2012-12-09,Tiến sĩ,2012-12-09,China,Hệ thống thông tin,Khoa Công nghệ thông tin,5
3,4,4,Không,2006-03-21,Thạc sĩ,2006-03-21,Russia,Khoa học máy tính,Khoa Công nghệ thông tin,1
4,5,5,Không,2014-07-16,Thạc sĩ,2014-07-16,Portugal,Công nghệ thông tin,Khoa Công nghệ thông tin,7

In [10]:
# lecturer['Academic Title Date'] = pd.to_datetime(lecturer['Academic Title Date'])
# lecturer['Degree Issue Date'] = pd.to_datetime(lecturer['Degree Issue Date'])

In [11]:
lecturer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 168 entries, 0 to 167
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Lecturer ID          168 non-null    int64
 1   Employee ID          168 non-null    int64
 2   Academic Title       168 non-null    object
 3   Academic Title Date  168 non-null    object
 4   Degree               168 non-null    object
 5   Degree Issue Date    168 non-null    object
 6   Degree Issue Place   168 non-null    object
 7   Major                168 non-null    object
 8   Department           168 non-null    object
 9   Number Of Exp        168 non-null    int64
dtypes: int64(3), object(7)
memory usage: 13.2+ KB

## Course

In [12]:
course = pd.read_csv('data/course.csv')
course.head()

,lecturer_in_charge_id,course_name,total_credit,theory_credit,practice_credit,self_learning_credit
0,48,Toán cao cấp 1,3,3,0,4
1,57,Giáo dục thể chất 1,5,3,2,5
2,65,Giáo dục Quốc phòng và An ninh 1,3,1,2,3
3,12,Nhập môn Tin học,3,3,0,3
4,21,Nhập môn Lập trình,4,0,4,5

In [13]:
course.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80 entries, 0 to 79
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   lecturer_in_charge_id  80 non-null     int64
 1   course_name            80 non-null     object
 2   total_credit           80 non-null     int64
 3   theory_credit          80 non-null     int64
 4   practice_credit        80 non-null     int64
 5   self_learning_credit   80 non-null     int64
dtypes: int64(5), object(1)
memory usage: 3.9+ KB

## Programs

In [14]:
program = pd.read_csv('data/program.csv')
program.head()

    class_of  program_semester abc_of
0  2019-2023                 1      a
1  2019-2023                 2      a
2  2019-2023                 3      a
3  2019-2023                 4      a
4  2019-2023                 5      a

In [15]:
program.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48 entries, 0 to 47
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   class_of          48 non-null     object
 1   program_semester  48 non-null     int64
 2   abc_of            48 non-null     object
dtypes: int64(1), object(2)
memory usage: 1.2+ KB

## Teaching

In [16]:
teaching = pd.read_csv('data/teaching.csv')
teaching.head()

   course_id  program_id
0          1           1
1          1           9
2          1          17
3          1          25
4          1          33

In [17]:
teaching.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 480 entries, 0 to 479
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   course_id   480 non-null    int64
 1   program_id  480 non-null    int64
dtypes: int64(2)
memory usage: 7.6 KB

## Course_offering

In [18]:
course_offering = pd.read_csv('data/course_offering.csv')
course_offering.head()

   lecturer_id  course_id lecturer_type
0            1         48   theoretical
1            1         48     practical
2            1         65   theoretical
3            1         65     practical
4            1         10   theoretical

In [19]:
course_offering.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1606 entries, 0 to 1605
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   lecturer_id    1606 non-null   int64
 1   course_id      1606 non-null   int64
 2   lecturer_type  1606 non-null   object
dtypes: int64(2), object(1)
memory usage: 37.8+ KB

## Score

In [20]:
score = pd.read_csv('data/score.csv', dtype={'student_id': str})
score.head()

  student_id  offering_id  score score_type
0   19333301          163    6.0       tk_1
1   19333301          163    5.5       tk_2
2   19333301          163    9.5       tk_3
3   19333301          163    5.0         gk
4   19333301          163    3.0         ck

In [21]:
score.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 479858 entries, 0 to 479857
Data columns (total 4 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   student_id   479858 non-null  object
 1   offering_id  479858 non-null  int64
 2   score        479858 non-null  float64
 3   score_type   479858 non-null  object
dtypes: float64(1), int64(1), object(2)
memory usage: 14.6+ MB

**address -> employee -> student -> lecturer -> course -> program -> teaching -> course_offering -> score**

In [22]:
def insert_row(table, data):
    return f'INSERT INTO {table} VALUES{tuple(data)};'

In [23]:
sql = []

# address
for idx, (_, row) in enumerate(address.iterrows(), start=1):
    data = [idx] + row.values.tolist()
    sql.append(insert_row('address', data))

# employee
for idx, (_, row) in enumerate(employee.iterrows(), start=1):
    data = [idx] + row.values.tolist()
    sql.append(insert_row('employee', data))

# student
# Không cần thêm idx làm id
for _, row in student.iterrows():
    data = row.values.tolist()
    sql.append(insert_row('student', data))

# lecturer
# Không cần thêm idx làm id
for _, row in lecturer.iterrows():
    data = row.values.tolist()
    sql.append(insert_row('lecturer', data))

# course
for idx, (_, row) in enumerate(course.iterrows(), start=1):
    data = [idx] + row.values.tolist()
    sql.append(insert_row('course', data))

# program
for idx, (_, row) in enumerate(program.iterrows(), start=1):
    data = [idx] + row.values.tolist()
    sql.append(insert_row('program', data))

# teaching
for idx, (_, row) in enumerate(teaching.iterrows(), start=1):
    data = [idx] + row.values.tolist()
    sql.append(insert_row('teaching', data))

# course_offering
for idx, (_, row) in enumerate(course_offering.iterrows(), start=1):
    data = [idx] + row.values.tolist()
    sql.append(insert_row('course_offering', data))

# score
for idx, (_, row) in enumerate(score.iterrows(), start=1):
    data = [idx] + row.values.tolist()
    sql.append(insert_row('score', data))

In [24]:
len(sql)

484894

In [25]:
with open('sql/insert_db.sql', 'w', encoding='utf-8') as f:
    f.write('\n'.join(sql))